# IsValidRenderLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings..::..IsValidRenderLevel Method
RenderingQualitySettings Class See Also
---
Validate the render level is between 1 and 40
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsValidRenderLevel(
	int value
)
```

Visual Basic
---
```text
Public Function IsValidRenderLevel ( _
	value As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidRenderLevel(
	int value
)
```

# ### Parameters
value
    Type: System..::..Int32 The render level value to validate.
# ### Return Value
True if the render level value is in the proper range, false otherwise.
# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace